# Support Vector Machine

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [7]:
data = pd.read_csv("C:/Users/HP/OneDrive/Desktop/DataAnalysisFiles/Datasets/Social_Network_Ads.csv")
data.head()

   Age  EstimatedSalary  Purchased
0   19            19000          0
1   35            20000          0
2   26            43000          0
3   27            57000          0
4   19            76000          0

In [10]:
#Initalize the data
X = data.iloc[:,:-1]
y = data.iloc[:,-1]
X

     Age  EstimatedSalary
0     19            19000
1     35            20000
2     26            43000
3     27            57000
4     19            76000
..   ...              ...
395   46            41000
396   51            23000
397   50            20000
398   36            33000
399   49            36000

[400 rows x 2 columns]

# splitting the dataset into train & test datase

In [21]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)

In [14]:
X_train

     Age  EstimatedSalary
157   29            75000
109   38            80000
17    45            26000
347   54           108000
24    46            23000
..   ...              ...
71    24            27000
106   26            35000
270   43           133000
348   39            77000
102   32            86000

[280 rows x 2 columns]

In [16]:
y_train

157    0
109    0
17     1
347    1
24     1
      ..
71     0
106    0
270    0
348    0
102    0
Name: Purchased, Length: 280, dtype: int64

In [17]:
X_test

     Age  EstimatedSalary
209   46            22000
280   59            88000
33    28            44000
210   48            96000
93    29            28000
..   ...              ...
60    27            20000
79    26            17000
285   37            93000
305   42            54000
281   35            61000

[120 rows x 2 columns]

# Feature scaling - Standardization

In [20]:
#from sklearn.preprocessing import StandardScaler,MinMaxScaler
#sc = StandardScaler()
#X_train = sc.fit_transform(X_train)
#X_test = sc.fit_transform(X_test)

# Feature Scaling - Normalization

In [22]:
from sklearn.preprocessing import StandardScaler,MinMaxScaler
norm = MinMaxScaler()
X_train = norm.fit_transform(X_train)
X_test = norm.fit_transform(X_test)

# SVM

In [23]:
# for Regression
from sklearn.svm import SVR

In [24]:
# for Clasiifier
from sklearn.svm import SVC
classifier = SVC()
classifier.fit(X_train,y_train)

SVC()

In [25]:
pred = classifier.predict(X_test)

In [28]:
from sklearn.metrics import accuracy_score,confusion_matrix
accuracy_score(y_test,pred)

0.9416666666666667

In [29]:
confusion_matrix(y_test,pred)

array([[68,  5],
       [ 2, 45]], dtype=int64)

# Logistic Regression

In [45]:
data = pd.read_csv("C:/Users/HP/OneDrive/Desktop/DataAnalysisFiles/Datasets/Social_Network_Ads.csv")
data.head()

   Age  EstimatedSalary  Purchased
0   19            19000          0
1   35            20000          0
2   26            43000          0
3   27            57000          0
4   19            76000          0

In [46]:
#Initalize the data
X = data.iloc[:,:-1]
y = data.iloc[:,-1]

In [47]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)

# Normalization

In [54]:
from sklearn.preprocessing import StandardScaler,MinMaxScaler
norm = MinMaxScaler()
X_train = norm.fit_transform(X_train)
X_test = norm.fit_transform(X_test)

In [55]:
from sklearn.linear_model import LogisticRegression

In [56]:
Log = LogisticRegression()

In [57]:
Log.fit(X_train,y_train)

LogisticRegression()

In [58]:
Log.score(X_test,y_test)

0.8416666666666667

In [59]:
y_pred = Log.predict(X_test)

In [60]:
accuracy_score(y_test,y_pred)

0.8416666666666667